{
  "Mystical Agnosticism": "You recognize that there may be dimensions of reality that are inherently ineffable and beyond conceptual understanding.",
  "Pragmatic Spirituality": "You focus on what 'works' experientially, valuing practices and ideas that produce positive transformation in your life, regardless of their metaphysical truth claims.",
  "Philosophical Spirituality": "You approach spiritual questions through philosophical inquiry, valuing rigorous thinking about ultimate reality while remaining open to mystery.",
  "Epistemological Agnosticism": "You maintain that certain metaphysical questions about ultimate reality are in principle unanswerable by human minds due to inherent limitations in our cognitive capacities and the nature of evidence available to us.",
  "Perpetual Inquiry": "You value the ongoing exploration of multiple traditions and perspectives as worthwhile in itself, not merely as a transitional phase toward a final answer.",
  "Intervention Origins": "You believe extraterrestrials genetically engineered or modified early humans, explaining the 'missing link' in evolution and humanity's rapid cognitive development.",
  "Technological Guidance": "You believe aliens provided advanced knowledge to early civilizations, explaining seemingly impossible ancient achievements like precise megalithic structures or sophisticated astronomical knowledge.",
  "Religious Foundations": "You see major religions as based on misunderstood extraterrestrial contact, with gods actually being advanced aliens, miracles being technology, and religious artifacts (like the Ark of the Covenant) being alien devices.",
  "Ongoing Presence": "You believe ancient astronauts never fully left Earth and continue to monitor or influence human development, possibly from hidden bases or through ongoing genetic programs.",
  "Traditional Animism": "You believe all things (animals, plants, rocks, rivers, weather systems) possess spirits, consciousness, or personhood, forming a community of beings with agency beyond humans.",
  "Neo-Animism": "You've developed a contemporary animistic practice that recognizes consciousness or personhood in natural entities, perhaps blending traditional ideas with modern ecological awareness, phenomenology, or systems thinking.",
  "Panpsychism": "You believe consciousness is a fundamental feature of the universe, present to some degree in all things, even at the subatomic level.",
  "Buddhist Mind-Only": "You understand that the external world is a manifestation of mind, not separate from it.",
  "Luminous Awareness": "You experience reality as the unity of emptiness and aware presence.",
  "Universal Mind": "You understand the universe as appearing within a cosmic consciousness.",
  "Mind-Shaped Reality": "You recognize that the basic structures of reality (space, time, causality) are features of how our minds organize experience, not independent features existing 'out there.'",
  "Classical Deism": "You believe God created the universe with perfectly designed natural laws and then stepped back, letting it run like a cosmic clock.",
  "Modern Deism": "While you believe a creator initiated the universe, you're open to limited divine interaction or periods of involvement.",
  "Scientific Deism": "You see the fundamental laws and constants of physics as evidence of design, particularly their fine-tuning that permits life.",
  "Biblical Flat Earth": "You hold that scripture clearly describes a stationary Earth with the firmament above, the waters below, and the sun and moon as luminaries that move across the sky.",
  "Conspiratorial Flat Earth": "You've discovered compelling evidence that powerful institutions are deliberately concealing the true flat nature of Earth.",
  "Experiential Flat Earth": "You prioritize your direct sensory experience over abstract scientific claims.",
  "Classical Gnosticism": "You believe the material world was created by an imperfect or malevolent Demiurge, not the true God.",
  "Philosophical Dualism": "You see reality as fundamentally divided between mind/spirit and matter, or between good and evil principles.",
  "Modern Matrix Skepticism": "You experience a deep intuition that consensus reality is somehow false or incomplete—a veil obscuring a more profound truth.",
  "Place-Based Knowledge": "You participate in a living relationship with the specific lands and ecosystems that have sustained indigenous people for countless generations.",
  "Kinship Cosmology": "You recognize humans as just one kind of person in a vast extended family that includes animal persons, plant persons, stone persons, and other beings.",
  "Ceremonial Reality": "You participate in ceremonies not as symbolic rituals but as real actions that maintain cosmic balance and renew vital relationships between humans and other-than-human persons.",
  "Ancestral Continuity": "You experience time as cyclical rather than linear, with ancestors remaining present and actively involved in current affairs rather than relegated to a distant past.",
  "It from Bit": "Following physicist John Wheeler's insight, you see information ('bit') as more fundamental than matter ('it').",
  "Computational Universe": "You understand the universe as fundamentally computational, with physical processes representing the execution of underlying algorithms.",
  "Entropic Gravity": "You recognize that physical forces like gravity may be emergent consequences of information and entropy rather than fundamental forces.",
  "Observer-Dependent Reality": "You understand reality as fundamentally shaped by what can be observed and measured, with the limits of information transfer defining the structure of physics.",
  "Continuous Creation": "You understand God's creative activity as ongoing rather than completed in the distant past.",
  "Dependent Existence": "You recognize that all beings depend completely on God for their existence, deriving their reality from the only Being who exists independently.",
  "Divine Qualities in Creation": "You see the cosmos as expressing divine qualities and attributes, with each created thing reflecting specific aspects of divine reality.",
  "Layered Reality": "You understand existence as arranged in levels of being, from the visible material world to unseen spiritual realms, with different orders of celestial beings mediating between these dimensions.",
  "Many-Sided Reality": "You recognize that reality is infinitely complex and can only be understood through multiple, complementary perspectives.",
  "Eternal Universe": "You understand the cosmos as uncreated and endless, with no beginning or end, cycling through great cosmic time cycles.",
  "Multiple Realms": "You recognize a specific cosmic structure with many levels of existence, including heavenly realms, our middle world, and lower realms.",
  "Universal Life": "You see the entire universe as alive and aware to varying degrees, with even apparently lifeless elements having some form of consciousness.",
  "Quantum Many-Worlds": "You believe every quantum event (like the measurement of a particle) creates branch universes where each possible outcome occurs.",
  "Cosmic Bubble Universes": "You accept the model where our universe is one bubble in an eternally expanding space, with other universe 'bubbles' having potentially different physical laws, constants, and dimensions.",
  "Higher-Dimensional Branes": "Based on string theory, you believe our universe exists on a membrane ('brane') in higher-dimensional space, with other universes potentially existing on other branes that occasionally interact with ours.",
  "Cyclical Universe": "You believe our universe undergoes endless cycles of expansion and contraction (or similar rebirth patterns), with each cycle potentially having different properties, effectively creating a temporal multiverse.",
  "Consciousness-Focused": "You believe consciousness creates reality, with thoughts and intentions directly affecting the material world.",
  "Energy-Based": "You focus on subtle energies, chakras, auras, and vibrational frequencies.",
  "Evolutionary Consciousness": "You believe humanity is evolving toward higher consciousness and greater spiritual awareness.",
  "Eclectic Synthesis": "You draw from multiple spiritual traditions, ancient wisdom, and modern metaphysics, creating a personalized path.",
  "Buddhist Emptiness": "You recognize that all things lack independent existence and arise through interconnection.",
  "Direct Experience Zen": "You emphasize immediate experience beyond words and ideas.",
  "Unity of Self and Cosmos": "You recognize that your deepest self and ultimate reality are fundamentally the same.",
  "Sacred Manifestation": "You understand reality as the dynamic interplay of consciousness and energy, where the universe is awareness expressing itself.",
  "Natural Harmony": "You perceive the cosmos as the flowing balance of complementary forces that form an indivisible whole.",
  "Process Panentheism": "Following Alfred North Whitehead's vision of reality as dynamic process rather than static substance, you see God and the world in mutual becoming, with God including yet transcending the universe.",
  "Emanationist Panentheism": "You understand the cosmos as flowing from or emanating from divine reality while remaining within it.",
  "Participatory Panentheism": "You see the universe as participating in divine reality through consciousness.",
  "Classical Pantheism": "Following Spinoza, you understand God and Nature as identical—there is only one fundamental reality which can be viewed either as 'God' or as 'Nature.'",
  "Scientific Pantheism": "You find deep spiritual meaning in the universe as revealed by science, without adding supernatural elements.",
  "Monistic Pantheism": "You understand all apparent diversity and multiplicity as ultimately a single unified reality.",
  "Organic Pantheism": "You experience the universe as a living whole, like a cosmic organism with all parts interdependent and alive with divine presence.",
  "Mystical Pantheism": "You have directly experienced moments of profound unity with all existence, dissolving the boundaries between self and world.",
  "Classical Polytheism": "You believe in multiple distinct deities with different domains, personalities, and powers, similar to ancient traditions like Greek, Norse, or Egyptian pantheons.",
  "Henotheism": "While acknowledging many gods exist, you primarily worship or connect with one deity, perhaps as your patron or as particularly relevant to your life.",
  "Reconstructionist Polytheism": "You practice a revived form of ancient polytheistic religion, attempting to reconstruct historical worship practices while adapting them to contemporary life.",
  "Hard Polytheism": "You believe each deity is absolutely distinct, with separate consciousness, will, and essence.",
  "Reductive Materialism": "You value the elegance and explanatory power of understanding all phenomena, including consciousness, as ultimately reducible to fundamental physical particles and forces.",
  "Emergent Materialism": "You recognize that while the universe is fundamentally physical, complex systems develop genuinely novel properties not predictable from analysis of their components alone.",
  "Pragmatic Instrumentalism": "You see scientific theories as powerful tools for prediction and control rather than literal descriptions of an ultimate reality.",
  "Poetic Naturalism": "Following Sean Carroll's approach, you embrace multiple valid ways of talking about reality at different levels (physical, biological, psychological), all compatible with a fundamental physical world.",
  "Technological Simulation": "You believe our reality is a computer simulation created by an advanced civilization (perhaps our own descendants).",
  "Divine Simulation": "You see the simulation as created by a god-like entity, making this perspective similar to certain religious views but framed in technological terms.",
  "Nested Realities": "You suspect we exist in just one level of many nested simulations, with simulators themselves being simulated.",
  "Conscious Simulation": "You believe the simulation isn't computational but consciously generated—more like a vast shared dream or mental construct than a computer program.",
  "Scientific Spirituality": "You find profound spiritual meaning in scientific understanding itself, experiencing awe and wonder through cosmology, evolution, and natural processes.",
  "Naturalistic Buddhism": "You embrace Buddhist insights and practices while interpreting them in naturalistic terms.",
  "Philosophical Naturalism": "You find meaning, value, and purpose within a fully natural cosmos through philosophical reflection.",
  "Embodied Spirituality": "You experience spirituality primarily through the body and its connection to the natural world.",
  "Naturalistic Taoism": "You appreciate the Taoist emphasis on harmony with natural processes, the balance of complementary forces, and the wisdom of non-action (wu-wei).",
  "Divine Natural Processes": "You understand God as creating through natural evolutionary processes rather than instantaneous acts.",
  "Guided Development": "You recognize that God intervened at key moments throughout Earth's long history.",
  "Purposeful Direction": "You see evolution as moving purposefully toward greater complexity, consciousness, and spiritual capacity.",
  "Community-Ancestral Connection": "You see reality as fundamentally relational, with ancestors actively participating in present community life.",
  "Cyclical-Sacred Time": "You experience time as cyclical rather than linear, with cosmic patterns manifesting through seasonal ceremonies, divination systems, and initiation rites.",
  "Divination-Based Causality": "You recognize that visible events have invisible causes that can be discerned through divination systems (such as Ifá, throwing the bones, or other traditional methods).",
  "Vitality-Force Cosmology": "You understand the universe as animated by a vital force or energy (known as àse, nyama, or similar concepts across different African traditions) that flows through all beings.",
  "Natural Process & Spontaneity": "You understand the universe as self-generating (ziran) rather than created.",
  "Pattern Correspondence & Complementarity": "You see all aspects of reality as expressions of complementary, mutually-generating forces (yin and yang).",
  "Integral Cultivation": "You embrace a holistic approach to Daoist practice that integrates philosophical understanding, energetic cultivation, ritual engagement, and practical embodiment.",
  "Hidden History Researcher": "You focus on investigating suppressed or alternative historical narratives, believing significant events or civilizations have been omitted from mainstream accounts.",
  "Alternative Physics Explorer": "You question fundamental scientific paradigms, suspecting that alternative energy technologies, gravity manipulation, or consciousness-based physical phenomena are possible but suppressed.",
  "Conspiracy Analyst": "You examine potential hidden power structures and deliberate manipulations of public information, looking for patterns that suggest coordinated deception across institutions.",
  "Open Skeptic": "You maintain a stance of questioning both mainstream and alternative explanations, recognizing the limits of human knowledge and the provisional nature of all explanations.",
  "Biblical Literalism": "You believe in a strict, literal reading of Genesis as God's inerrant word, with Earth being approximately 6,000-10,000 years old, created in six 24-hour days.",
  "Appearance of Age": "You believe God created the universe recently with a fully-functioning, mature appearance, just as Adam was created as an adult rather than an infant.",
  "Catastrophism": "You believe Earth is young, but its geology has been dramatically shaped by catastrophic events (especially Noah's global Flood), which explain phenomena like the fossil record, geological strata, and features that mainstream scientists wrongly attribute to long ages.",
  "Transitional Seeking": "You are actively exploring different spiritual traditions and worldviews, remaining open to discovery while not yet settling on a particular path.",
  "Analytical Idealism": "You believe consciousness is fundamental, with the physical world being a manifestation of mind rather than the other way around.",
  "Contemporary Non-Dualism": "You recognize the essential unity of awareness and phenomena, often through modern teachers and practices rather than traditional lineages.",
  "Neutral Monism": "You see both mind and matter as manifestations of a more fundamental, neutral substance that is neither mental nor physical.",
  "Quantum Idealism": "You believe quantum mechanics reveals the fundamental role of consciousness in creating physical reality through observation and measurement.",
  "Tantric Non-Dualism": "You embrace the unity of all existence through practices that transform ordinary experience into recognition of sacred awareness.",
  "Taoist Harmony": "You seek to live in harmony with the natural flow of the Tao, balancing complementary forces and following the principle of wu-wei (effortless action).",
  "Teilhardian Evolution": "You see evolution as a spiritual process moving toward greater complexity and consciousness, culminating in the Omega Point.",
  "Transcendental Idealism": "You believe the mind structures all possible experience, with reality as we know it being fundamentally shaped by the categories of understanding.",
  "Vajrayana Luminosity": "You practice the recognition of the luminous, empty nature of awareness through tantric methods and guru yoga.",
  "Vedantic Non-Dualism": "You recognize the ultimate truth that Atman (individual consciousness) and Brahman (universal consciousness) are one and the same.",
  "Yogācāra Buddhism": "You understand that the external world is a projection of consciousness, with all phenomena arising from the transformation of the underlying storehouse consciousness.",
  "Evolutionary Creationism": "You believe God created through evolutionary processes, with natural selection and common descent being the methods God used to bring about life's diversity.",
  "Progressive Creation": "You believe God intervened at specific points throughout Earth's long history to create new forms of life, combining old-earth geology with special creation events."
}